# ETL-Project

# Extract

In [1]:
# Dependencies
from bs4 import BeautifulSoup as bs
import pandas as pd

In [2]:
# URL of page to be scraped
url = 'https://www.pro-football-reference.com/players/salary.htm'

tables = pd.read_html(url)
tables

[          Rk              Player Pos   Tm       Salary
 0        1.0        Kirk Cousins  QB  MIN  $27,500,000
 1        2.0      Marcus Mariota  QB  TEN  $20,922,000
 2        NaN      Jameis Winston  QB  TAM  $20,922,000
 3        4.0          Derek Carr  QB  OAK  $19,900,000
 4        5.0          Joe Flacco  QB  DEN  $18,500,000
 ...      ...                 ...  ..  ...          ...
 1909     NaN       Michael Dogbe  DL  ARI     $495,000
 1910     NaN  Ross Pierschbacher  OL  WAS     $495,000
 1911  1912.0        Alex Redmond   G  CIN     $493,236
 1912  1913.0         Holton Hill  CB  MIN     $435,882
 1913  1914.0      Tyrone Swoopes  TE  SEA     $378,000

 [1914 rows x 5 columns]]

In [3]:
type(tables)

list

In [4]:
len(tables)

1

In [5]:
tables[0].dtypes

Rk        float64
Player     object
Pos        object
Tm         object
Salary     object
dtype: object

# Transform

In [6]:
df=tables[0]

In [7]:
df['Salary'] = df['Salary'].str.replace('$',"").str.replace(',',"")
df.head()

    Rk          Player Pos   Tm    Salary
0  1.0    Kirk Cousins  QB  MIN  27500000
1  2.0  Marcus Mariota  QB  TEN  20922000
2  NaN  Jameis Winston  QB  TAM  20922000
3  4.0      Derek Carr  QB  OAK  19900000
4  5.0      Joe Flacco  QB  DEN  18500000

In [8]:
df['Salary'].astype(int)
df.head()

    Rk          Player Pos   Tm    Salary
0  1.0    Kirk Cousins  QB  MIN  27500000
1  2.0  Marcus Mariota  QB  TEN  20922000
2  NaN  Jameis Winston  QB  TAM  20922000
3  4.0      Derek Carr  QB  OAK  19900000
4  5.0      Joe Flacco  QB  DEN  18500000

In [9]:
salary_df=df.fillna(method='ffill')
salary_df.head(10)

     Rk           Player Pos   Tm    Salary
0   1.0     Kirk Cousins  QB  MIN  27500000
1   2.0   Marcus Mariota  QB  TEN  20922000
2   2.0   Jameis Winston  QB  TAM  20922000
3   4.0       Derek Carr  QB  OAK  19900000
4   5.0       Joe Flacco  QB  DEN  18500000
5   6.0  Jimmy Garoppolo  QB  SFO  17200000
6   7.0       Von Miller  LB  DEN  17000000
7   7.0    Melvin Ingram  DE  LAC  17000000
8   7.0       Mike Evans  WR  TAM  17000000
9  10.0    Odell Beckham  WR  CLE  16750000

In [10]:
salary_df.count()

Rk        1914
Player    1914
Pos       1914
Tm        1914
Salary    1914
dtype: int64

In [11]:
# new data frame with split value columns 
new = salary_df["Player"].str.split(" ", n = 1, expand = True) 
  
# making separate first name column from new data frame 
salary_df["First_Name"]= new[0] 
  
# making separate last name column from new data frame 
salary_df["Last_Name"]= new[1]

In [12]:
salary_df.head()

    Rk          Player Pos   Tm    Salary First_Name Last_Name
0  1.0    Kirk Cousins  QB  MIN  27500000       Kirk   Cousins
1  2.0  Marcus Mariota  QB  TEN  20922000     Marcus   Mariota
2  2.0  Jameis Winston  QB  TAM  20922000     Jameis   Winston
3  4.0      Derek Carr  QB  OAK  19900000      Derek      Carr
4  5.0      Joe Flacco  QB  DEN  18500000        Joe    Flacco

In [13]:
salary_df['Rank']=salary_df['Rk']
salary_df['TM']=salary_df['Tm']
salary_df.head()

final_df=salary_df[['Rank', 'First_Name','Last_Name', 'Pos', 'TM', 'Salary']]
final_df.dtypes

Rank          float64
First_Name     object
Last_Name      object
Pos            object
TM             object
Salary         object
dtype: object

# Load

In [14]:
#Import additional dependancies
from sqlalchemy import create_engine
from sqlalchemy.types import Integer,BigInteger
import psycopg2

In [15]:
#Session Engine
engine = create_engine('postgresql://postgres:postgres@localhost:5432/nfl_db')
connection = engine.connect()

In [19]:
#Establishing the connection
conn = psycopg2.connect(
   database="nfl_db", user='postgres', password='postgres', host='127.0.0.1', port= '5432'
)
#Creating a cursor object using the cursor() method
cursor = conn.cursor()

#Doping EMPLOYEE table if already exists.
cursor.execute("DROP TABLE IF EXISTS salary")

#Creating table as per requirement
sql ='''CREATE TABLE salary(
   Rank INT NOT NULL,
   First_Name CHAR(30) NOT NULL,
   Last_Name CHAR(30)NOT NULL,
   POS CHAR(2) NOT NULL,
   TM CHAR(3) NOT NULL,
   Salary INT NOT NULL,
   Primary Key (Rank)
)'''
cursor.execute(sql)
print("Table created successfully........")

#Closing the connection
conn.close()

Table created successfully........

In [21]:
#Load dataframe to PostgreSQL
final_df.to_sql('salary', engine, if_exists='append',
               dtype={"Rank": Integer(),
                      "Salary": BigInteger()},index=False)